app/Controllers/NuevoController.php

    public function mostrar_valoraciones_porDocente_porMateria1()
    {
        $db = \Config\Database::connect();


        $sql2 = $db->table('materias');
        //$sql->select('id_carrera,nombre_carrera');
        $query2 = $sql2->get();
        $resultado2 = $query2->getResultArray();

        $data2 = ['titulo'=> 'Listado de Materias', 'materias'=>$resultado2];
        //return view('mostrarValidaciones', $data);

        $sql3 = $db->table('condicion_docente');
        //$sql->select('id_carrera,nombre_carrera');
        $query3 = $sql3->get();
        $resultado3 = $query3->getResultArray();

        $data3 = ['titulo'=> 'Listado de Materias', 'condicion'=>$resultado3];

        $sql5 = $db->table('docente');
        //$sql->select('id_carrera,nombre_carrera');
        $query5 = $sql5->get();
---
SELECT *
FROM `materias`
SELECT *
FROM `condicion_docente`
SELECT *
FROM `docente`

             $otros_t = new OtrosTitulosModel();
             // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
             foreach ($datosTabla9 as $t) {
                 $otros_titulo = $otros_t->find($t['id_otros_titulos']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `otros_titulos`
WHERE `otros_titulos`.`id_otros_titulos` = '1'

            $otros_t = new OtrosTitulosModel();
            // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
            foreach ($datosTabla8 as $t) {
            $otros_titulo = $otros_t->find($t['id_otros_titulos']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `otros_titulos`
WHERE `otros_titulos`.`id_otros_titulos` = '1'

            $datosTabla5 = $antDoc->getDatosById_ant_doc($id_va);//ACÁ PUEDE TRAER VARIOS
            $do = new DetalleAntDocModel();
            foreach ($datosTabla5 as $dc) {
               $detalle_do = $do->find($dc['id_detalle_doc']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_doc`
WHERE `detalle_ant_doc`.`id_detalle_doc` = '1'

            $datos_capacitacion = $cap->getCodigoById_detallae_cap($id_va);
            $ca = new DetalleCapacitacionModel();
            foreach ($datos_capacitacion as $c) {
                $capacitacion = $ca->find($c['id_detalle_capacitacion']);
---
SELECT *
FROM `detalle_capacitacion`
WHERE `detalle_capacitacion`.`id_detalle_capacitacion` = '1'

            $detalle_for = new DetalleFormacionOfrecidaModel();
            // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
            foreach ($datosTabla_f_o as $t) {
                $otra_for = $detalle_for->find($t['id_formacion_ofrecida']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_formacion_ofrecida`
WHERE `detalle_formacion_ofrecida`.`id_formacion_ofrecida` = '1'

            $detalle_inv = new DetalleInvestigacionModel();
            // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
            foreach ($datosTabla_inv as $t) {
                $otra_inv = $detalle_inv->find($t['id_detalle_investigacion']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_investigacion`
WHERE `detalle_investigacion`.`id_detalle_investigacion` = '1'

            $datosTabla4 = $antLab->getDatosById_detalle_lab($id_va);//ACÁ PUEDE TRAER
            $dl = new DetalleAntLabModel();
            foreach ($datosTabla4 as $de) {
               $detalle_la = $dl->find($de['id_detalle_lab']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_lab`
WHERE `detalle_ant_lab`.`id_detalle_lab` = '1'