app/Models/CapacitacionModel.php

SELECT *
FROM `capacitacion`
WHERE `id_valoracion` = '285'
---
    public function getCodigoById_detallae_cap($codigo)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('id_valoracion', $codigo);
        $query = $builder->get();