app/Models/DocenteModel.php

    public function getDatosDocentes($dni)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('dni', $dni);
        $query = $builder->get();
---
SELECT *
FROM `docente`
WHERE `dni` = '27269774'