app/Models/FormacionOfrecidaModel.php

    public function getCodigoById_formacion_ofrecida($codigo)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('id_valoracion', $codigo);
        $query = $builder->get();
---
SELECT *
FROM `formacion_ofrecida`
WHERE `id_valoracion` = '310'