app/Models/InvestigacionModel.php

    public function getCodigoById_detallae_inv($codigo)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('id_valoracion', $codigo);
        $query = $builder->get();
---
SELECT *
FROM `investigacion`
WHERE `id_valoracion` = '285'