app/Models/MateriasModel.php

    public function getNombreMateria($codigo)
   {
       $builder = $this->db->table($this->table);
       $builder->select('*');
       $builder->where('id_materia', $codigo);
       $query = $builder->get();
---
SELECT *
FROM `materias`
WHERE `id_materia` = '1'