app/Models/TitulosPostgradoModel.php

    public function getCodigoByPuntaje($id_tit_post)
   {
       $builder = $this->db->table($this->table);
       $builder->select('puntaje');
       $builder->where('id_titulo_postgrado', $id_tit_post);
       $query = $builder->get();
---
SELECT `puntaje`
FROM `titulos_postgrado`
WHERE `id_titulo_postgrado` = '1'