app/Models/TitulosModel.php

SELECT *
FROM `titulos`
WHERE `id_titulo` = '1'
---
    public function getDatosTitulos($codigo)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('id_titulo',$codigo);
        $query = $builder->get();