app/Models/ValidacionModel.php

   public function getValoracionDniMateria($dni, $id_materia)
   {
       $builder = $this->db->table($this->table);
       $builder->select('*');
       $builder->where('dni', $dni);
       $builder->where('id_materia_valoracion', $id_materia); // Ajuste en la clave para el segundo where
       $query = $builder->get();
---
SELECT *
FROM `valoracion`
WHERE `dni` = '27269774'
AND `id_materia_valoracion` = '2'