app/Models/ValoracionPostgradoModel.php

SELECT *
FROM `valoracion_postgrado`
WHERE `id_valoracion` = '285'
---
    public function getCodigoById_valoracion($codigo)
   {
       $builder = $this->db->table($this->table);
       $builder->select('*');
       $builder->where('id_valoracion', $codigo);
       $query = $builder->get();

UPDATE `valoracion_postgrado` SET `id_valoracion` = '294', `detalle_valoracion_postgrado` = 'doctorado11111', `fecha` = '2024-11-01', `id_titulo_postgrado` = '1'
WHERE `valoracion_postgrado`.`id_postgrado` IN ('190')
---
   public function updatePostgrado($id,$datos)
   {
       // Usa el método update() de la clase base
       return $this->update($id,$datos); // Aquí $dni es el id y $data son los nuevos valores