app/Models/ValoracionOtrosTitulosModel.php

SELECT *
FROM `valoracion_otros_titulos`
WHERE `id_valoracion` = '285'
---
   public function getCodigoById_valoracion($codigo)
   {
       $builder = $this->db->table($this->table);
       $builder->select('*');
       $builder->where('id_valoracion', $codigo);
       $query = $builder->get();

UPDATE `valoracion_otros_titulos` SET `id_valoracion` = '297', `detalle_otros_titulos` = 'diplom', `fecha` = '2024-11-01', `id_otros_titulos` = '1'
WHERE `valoracion_otros_titulos`.`id_otros_t` IN ('74')
---
   public function updateValoracion($va, $data)
   {
       // Usa el método update() de la clase base
       return $this->update($va, $data); // Aquí $dni es el id y $data son los nuevos valores